<div class="overlay js-overlay"></div>

<div class="popup js-popup" id="buy">
    <div class="popup__title">После оплаты Вы автоматически становитесь участником лотереи.</div>
    <form action="#" class="myform">
        <label for="email" class="myform__label">Укажите ваш Email</label>
        <input type="email" id="email" class="myform__input" required>
        <input type="submit" value="Оплатить" class="myform__submit" id="emailPopupBtn">
    </form>
</div>

<div class="popup js-popup" id="success">
    <img src="images/dist/logo.png" class="popup__logo" alt="">
    <div class="popup__title">Поздравляю, вы стали участником лотереи.<br><br>Желаем удачи!</div>
    <a href="" class="popup-btn">купить еще билет</a>
</div>

<div class="popup js-popup" id="mistake">
    <img src="images/dist/logo.png" class="popup__logo" alt="">
    <div class="popup__title">Что-то пошло не так!</div>
    <a href="" class="popup-btn">Попробовать еще раз!</a>
    <a href="" class="popup-btn">Связь с поддержкой!</a>
</div>
<div class="modal" id="userAgreementModal">
    <div class="modal-content">
        <h1>Политика в отношении обработки персональных данных</h1>
        <?php
        $text = "1. Общие положения
Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. № 152-ФЗ «О персональных данных» (далее — Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые ИП Кирилова К.И. (далее — Оператор).
1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.
1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее — Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта https://outfitchecklist.ru.
2. Основные понятия, используемые в Политике
2.1. Автоматизированная обработка персональных данных — обработка персональных данных с помощью средств вычислительной техники.
2.2. Блокирование персональных данных — временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных).
2.3. Веб-сайт — совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу https://outfitchecklist.ru.
2.4. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных и обеспечивающих их обработку информационных технологий и технических средств.
2.5. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных.
2.6. Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
2.7. Оператор — государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и/или осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.
2.8. Персональные данные — любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта https://outfitchecklist.ru.
2.9. Персональные данные, разрешенные субъектом персональных данных для распространения, — персональные данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем дачи согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в порядке, предусмотренном Законом о персональных данных (далее — персональные данные, разрешенные для распространения).
2.10. Пользователь — любой посетитель веб-сайта https://outfitchecklist.ru.
2.11. Предоставление персональных данных — действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц.
2.12. Распространение персональных данных — любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом.
2.13. Трансграничная передача персональных данных — передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу.
2.14. Уничтожение персональных данных — любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и/или уничтожаются материальные носители персональных данных.
3. Основные права и обязанности Оператора
3.1. Оператор имеет право:
— получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные;
— в случае отзыва субъектом персональных данных согласия на обработку персональных данных, а также, направления обращения с требованием о прекращении обработки персональных данных, Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в Законе о персональных данных;
— самостоятельно определять состав и перечень мер, необходимых и достаточных для обеспечения выполнения обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с ним нормативными правовыми актами, если иное не предусмотрено Законом о персональных данных или другими федеральными законами.
3.2. Оператор обязан:
— предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его персональных данных;
— организовывать обработку персональных данных в порядке, установленном действующим законодательством РФ;
— отвечать на обращения и запросы субъектов персональных данных и их законных представителей в соответствии с требованиями Закона о персональных данных;
— сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа необходимую информацию в течение 10 дней с даты получения такого запроса;
— публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в отношении обработки персональных данных;
— принимать правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных;
— прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных данных;
— исполнять иные обязанности, предусмотренные Законом о персональных данных.
4. Основные права и обязанности субъектов персональных данных
4.1. Субъекты персональных данных имеют право:
— получать информацию, касающуюся обработки его персональных данных, за исключением случаев, предусмотренных федеральными законами. Сведения предоставляются субъекту персональных данных Оператором в доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких персональных данных. Перечень информации и порядок ее получения установлен Законом о персональных данных;
— требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;
— выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на рынке товаров, работ и услуг;
— на отзыв согласия на обработку персональных данных, а также, на направление требования о прекращении обработки персональных данных;
— обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных;
— на осуществление иных прав, предусмотренных законодательством РФ.
4.2. Субъекты персональных данных обязаны:
— предоставлять Оператору достоверные данные о себе;
— сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных.
4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных данных без согласия последнего, несут ответственность в соответствии с законодательством РФ.
5. Принципы обработки персональных данных
5.1. Обработка персональных данных осуществляется на законной и справедливой основе.
5.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных.
5.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой.
5.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки.
5.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их обработки.
5.6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных. Оператор принимает необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных или неточных данных.
5.7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные уничтожаются либо обезличиваются по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено федеральным законом.
6. Цели обработки персональных данных
Цель обработки
предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся на веб-сайте
Персональные данные
электронный адрес
номера телефонов
Правовые основания
уставные (учредительные) документы Оператора
договоры, заключаемые между оператором и субъектом персональных данных
Виды обработки персональных данных
Сбор, запись, систематизация, накопление, хранение, уничтожение и обезличивание персональных данных
Отправка информационных писем на адрес электронной почты

7. Условия обработки персональных данных
7.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных.
7.2. Обработка персональных данных необходима для достижения целей, предусмотренных международным договором Российской Федерации или законом, для осуществления возложенных законодательством Российской Федерации на оператора функций, полномочий и обязанностей.
7.3. Обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта другого органа или должностного лица, подлежащих исполнению в соответствии с законодательством Российской Федерации об исполнительном производстве.
7.4. Обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем по которому является субъект персональных данных, а также для заключения договора по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться выгодоприобретателем или поручителем.
7.5. Обработка персональных данных необходима для осуществления прав и законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и свободы субъекта персональных данных.
7.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных либо по его просьбе (далее — общедоступные персональные данные).
7.7. Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в соответствии с федеральным законом.
8. Порядок сбора, хранения, передачи и других видов обработки персональных данных
Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.
8.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.
8.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства либо в случае, если субъектом персональных данных дано согласие Оператору на передачу данных третьему лицу для исполнения обязательств по гражданско-правовому договору.
8.3. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора ilyaruzaev@ya.com с пометкой «Актуализация персональных данных».
8.4. Срок обработки персональных данных определяется достижением целей, для которых были собраны персональные данные, если иной срок не предусмотрен договором или действующим законодательством.
Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора ilyaruzaev@ya.com с пометкой «Отзыв согласия на обработку персональных данных».
8.5. Вся информация, которая собирается сторонними сервисами, в том числе платежными системами, средствами связи и другими поставщиками услуг, хранится и обрабатывается указанными лицами (Операторами) в соответствии с их Пользовательским соглашением и Политикой конфиденциальности. Субъект персональных данных и/или с указанными документами. Оператор не несет ответственность за действия третьих лиц, в том числе указанных в настоящем пункте поставщиков услуг.
8.6. Установленные субъектом персональных данных запреты на передачу (кроме предоставления доступа), а также на обработку или условия обработки (кроме получения доступа) персональных данных, разрешенных для распространения, не действуют в случаях обработки персональных данных в государственных, общественных и иных публичных интересах, определенных законодательством РФ.
8.7. Оператор при обработке персональных данных обеспечивает конфиденциальность персональных данных.
8.8. Оператор осуществляет хранение персональных данных в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных.
8.9. Условием прекращения обработки персональных данных может являться достижение целей обработки персональных данных, истечение срока действия согласия субъекта персональных данных, отзыв согласия субъектом персональных данных или требование о прекращении обработки персональных данных, а также выявление неправомерной обработки персональных данных.
9. Перечень действий, производимых Оператором с полученными персональными данными
9.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение персональных данных.
9.2. Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей полученной информации по информационно-телекоммуникационным сетям или без таковой.
10. Трансграничная передача персональных данных
10.1. Оператор до начала осуществления деятельности по трансграничной передаче персональных данных обязан уведомить уполномоченный орган по защите прав субъектов персональных данных о своем намерении осуществлять трансграничную передачу персональных данных (такое уведомление направляется отдельно от уведомления о намерении осуществлять обработку персональных данных).
10.2. Оператор до подачи вышеуказанного уведомления, обязан получить от органов власти иностранного государства, иностранных физических лиц, иностранных юридических лиц, которым планируется трансграничная передача персональных данных, соответствующие сведения.
11. Конфиденциальность персональных данных
Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено федеральным законом.
12. Заключительные положения
12.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты ilyaruzaev@ya.com.
12.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.
12.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу https://beautylottery.ru/privacy/.
";

        // Форматировать текст с заголовками
        $formattedText = formatTextWithHeaders($text);

        echo $formattedText;
        ?>
        <button id="closeUserAgreementModal" class="popup-btn">Закрыть</button>
    </div>
</div>
<div class="modal" id="infoProductModal" style="display: none;">
    <div class="modal-content">
        <h1>Подробная информация</h1>
        <p class="mt-1">Чек-лист гардеробных капсул - это инновационный продукт, который поможет максимально оптимизировать свой гардероб и создать стильные и модные образы с минимальными усилиями. При создании этих чек-листов учитываются тренды моды, сезонность и мои личные вкусовые предпочтения.</p>
        <p></p><p class="mt-1">Гардеробные капсулы представляют собой метод организации гардероба, основанный на стратегии минимализма и эффективного использования одежды. В нашем чек-листе для вас будет составлен небольшой набор предметов одежды, которые легко сочетаются между собой и подходят для различных сезонов. Это включает базовые предметы одежды, такие как футболки, рубашки, свитера, верхняя одежда, юбки, брюки, обувь и аксессуары.</p>
        <p></p><p class="mt-1">Главная цель нашего чек-листа - сделать функциональный и универсальный гардероб, позволяющий вам создавать разнообразные стили и сочетать одежду различными способами. Это может быть особенно полезно, если у вас ограниченное пространство для хранения одежды или если вы стремитесь к устойчивому образу жизни, сокращая потребление и избегая частой покупки новых вещей.</p>
        <p></p><p class="mt-1">Польза нашего чек-листа включает в себя следующее:</p>
        <p></p><p class="mt-1">А) Экономия времени: Гардеробная капсула позволяет сэкономить время на выборе одежды каждый день. У вас уже будет ясное представление о том, какие предметы одежды сочетаются друг с другом, и вы сможете легко создавать стильные и готовые к ношению образы.</p>
        <p></p><p class="mt-1">Б) Экономия денег: Определенный набор одежды в гардеробной капсуле помогает избегать необдуманных покупок и выбору вещей, которые вы носить не будете. Вы будете инвестировать в качественные и универсальные предметы одежды, которые будут служить вам долгое время.</p>
        <p></p> <p class="mt-1">В) Устойчивость: Концепция гардеробных капсул вписывается в идеи устойчивого образа жизни, поскольку помогает сократить потребление и уменьшить влияние промышленности моды на природу. Составляя сознательно свой гардероб, вы будете выбирать вещи, которые вы действительно нуждались и которые вы будете носить на протяжении долгого времени.</p>
        <p></p><p class="mt-1">Наши чек-листы будут в электронном формате в виде документа. Это позволит вам сразу увидеть готовые образы в удобном формате с изображениями.  На каждую вещь из чек-листа будет оставлена ссылка или артикул. Содержание:</p>
        <p>Сезонная одежда;</p>
        <p>Обувь;</p>
        <p>Аксессуары;</p>
        <p>Головные уборы;</p>
        <p>Сумки.</p>
        <p></p><p class="mt-1">После оплаты выбранного чек-листа на нашем сайте вам будет доступна ссылка для сканирования чек-листа.</p>
        <button id="closeInfoProductModal" class="popup-btn">Закрыть</button>
    </div>
</div>



<?php
function formatTextWithHeaders($text) {
    // Разделить текст на строки
    $lines = explode("\n", $text);

    $formattedText = '';
    $currentHeader = '';

    foreach ($lines as $line) {
        // Проверить, начинается ли строка с номера пункта (цифры и точка)
        if (preg_match('/^\d+\./', $line, $matches)) {
            // Если строка начинается с номера пункта, это заголовок
            $currentHeader = trim($line);
            // Добавить заголовок к отформатированному тексту
            $formattedText .= "<h2>$currentHeader</h2>";
        } else {
            // В противном случае, это обычный абзац, добавить его к отформатированному тексту
            $formattedText .= "<p>$line</p>";
        }

        // Добавить дополнительный отступ перед крупными блоками (номерами пунктов)
        if (preg_match('/^\d+\./', $line)) {
            $formattedText .= "<br>";
        }
    }

    return $formattedText;
}


?>
